<a href="https://colab.research.google.com/github/iampramodyadav/SQL/blob/main/Creating_Multiple_Table_SQL_DATABASE_CSV_sqlite3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Creating Databse with multiple table from csv files


---
Pramod kumar yadav
@iampramodyadav

## Loading CSV files from google dive via CURLGET and unzipping it

In [9]:
!wget --header="Host: doc-14-5o-drive-data-export.googleusercontent.com" --header="User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.114 Safari/537.36 Edg/91.0.864.59" --header="Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9" --header="Accept-Language: en-US,en;q=0.9" --header="Cookie: AUTH_vhphm33fusgecji7kuoa3rc0nh79nagd_nonce=jdp107cten97o" --header="Connection: keep-alive" "https://doc-14-5o-drive-data-export.googleusercontent.com/download/t2i47i2m4qr4e0uv406c834hlo4c0t3q/gle617ab1v23voi6u9csdc2hc93k06ld/1625044500000/b3cc7eab-d800-429a-a5b3-c9a93048f40c/111118528152204709033/ADt3v-PXOmb44enIpYej-r-sqno796-URPkiQgKwK8FbgFGZIvh9HUZskywUrtvVwAsQRUBB1LVB3OKgjjhOtXLsZ6mXRuKkaLKX92YEZLlKeSIZqPeotOHcwUiHUAGaPUAhgptH8Jey7QbWxp0ysMlGf8fMEKzDuX7p4uFURTQ3CQ8Yju7vUNZuJH0oeXuxkWjHBwPG15IP7mNuEpPIyaSbV9hDJDpZ6TrMzmS3N2tZbubiq7lrZFbPybvaLOTXUwKtdHKyAHqLdc6zvXbsw2SSQUKADLdVOwObLYcCvIAt2wHUy-4Az2iYQcVGFPA5SFRCzGFGf92y?authuser=0&nonce=jdp107cten97o&user=111118528152204709033&hash=irrsofj9c5vmhlnktqc1dcpsis679l7r" -c -O 'dataset-20210630T102656Z-001.zip'

--2021-06-30 10:27:31--  https://doc-14-5o-drive-data-export.googleusercontent.com/download/t2i47i2m4qr4e0uv406c834hlo4c0t3q/gle617ab1v23voi6u9csdc2hc93k06ld/1625044500000/b3cc7eab-d800-429a-a5b3-c9a93048f40c/111118528152204709033/ADt3v-PXOmb44enIpYej-r-sqno796-URPkiQgKwK8FbgFGZIvh9HUZskywUrtvVwAsQRUBB1LVB3OKgjjhOtXLsZ6mXRuKkaLKX92YEZLlKeSIZqPeotOHcwUiHUAGaPUAhgptH8Jey7QbWxp0ysMlGf8fMEKzDuX7p4uFURTQ3CQ8Yju7vUNZuJH0oeXuxkWjHBwPG15IP7mNuEpPIyaSbV9hDJDpZ6TrMzmS3N2tZbubiq7lrZFbPybvaLOTXUwKtdHKyAHqLdc6zvXbsw2SSQUKADLdVOwObLYcCvIAt2wHUy-4Az2iYQcVGFPA5SFRCzGFGf92y?authuser=0&nonce=jdp107cten97o&user=111118528152204709033&hash=irrsofj9c5vmhlnktqc1dcpsis679l7r
Resolving doc-14-5o-drive-data-export.googleusercontent.com (doc-14-5o-drive-data-export.googleusercontent.com)... 172.217.2.97, 2607:f8b0:4004:80a::2001
Connecting to doc-14-5o-drive-data-export.googleusercontent.com (doc-14-5o-drive-data-export.googleusercontent.com)|172.217.2.97|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 2251 (2.2K) [application/octet-stream]
Saving to: ‘dataset-20210630T102656Z-001.zip’

dataset-20210630T10 100%[===================>]   2.20K  --.-KB/s    in 0s

2021-06-30 10:27:32 (29.8 MB/s) - ‘dataset-20210630T102656Z-001.zip’ saved [2251/2251]

In [10]:
!unzip "dataset-20210630T102656Z-001.zip"

Archive:  dataset-20210630T102656Z-001.zip
replace dataset/dataset.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: dataset/dataset.csv
  inflating: dataset/department.csv
  inflating: dataset/locatiodata.csv
  inflating: dataset/emplyees.csv
  inflating: dataset/jobsdata.csv
  inflating: dataset/jobhistory.csv

# Creating database

In [11]:
import sqlite3
import pandas as pd
sqlite3.connect('PETRESCUE.db')

In [12]:
pd.read_csv('dataset/jobhistory.csv')

     EMPL_ID  START_DATE  JOBS_ID  DEPT_ID
0  E1002      2001-08-01      200        5
1  E1003      2001-08-16      300        5
2  E1004      2000-08-16      400        5
3  E1005      2000-05-30      500        2
4  E1006      2001-08-16      600        2
5  E1007      2002-05-30      650        7
6  E1008      2010-05-06      660        7
7  E1009      2016-08-16      234        7
8  E1010      2016-08-16      220        5

## adding first table

In [14]:
#credit @geekforgeeks

# Import required libraries
import sqlite3
import pandas as pd

# Connect to SQLite database
conn = sqlite3.connect(r'dataset.db')

# Load CSV data into Pandas DataFrame
employ_data = pd.read_csv('dataset/emplyees.csv')
# Write the data to a sqlite table
employ_data.to_sql('EMPLOYEE', conn, if_exists='replace', index=False)

# Create a cursor object
cur = conn.cursor()
# Fetch and display result
for row in cur.execute('SELECT * FROM EMPLOYEE'):
	print(row)
# Close connection to SQLite database
conn.close()

('E1002    ', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000.0, 30002, 5)
('E1003    ', 'Steve', 'Wells', 123458, '1980-08-10', 'M', '291 Springs, Gary,IL', 300, 50000.0, 30002, 5)
('E1004    ', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000.0, 30004, 5)
('E1005    ', 'Ahmed', 'Hussain', 123410, '1981-01-04', 'M', '216 Oak Tree, Geneva,IL', 500, 70000.0, 30001, 2)
('E1006    ', 'Nancy', 'Allen', 123411, '1978-02-06', 'F', '111 Green Pl, Elgin,IL', 600, 90000.0, 30001, 2)
('E1007    ', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000.0, 30003, 7)
('E1008    ', 'Bharath', 'Gupta', 123413, '1985-05-06', 'M', '145 Berry Ln, Naperville,IL', 660, 65000.0, 30003, 7)
('E1009    ', 'Andrea', 'Jones', 123414, '1990-07-09', 'F', '120 Fall Creek, Gary,IL', 234, 70000.0, 30003, 7)
('E1010    ', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000.0, 30004, 5)

## adding 2nd table

In [16]:
conn = sqlite3.connect(r'dataset.db')

dept_data = pd.read_csv('dataset/department.csv')

dept_data.to_sql('DEPARTMENT', conn, if_exists='replace', index=False)


cur = conn.cursor()
for row in cur.execute('SELECT * FROM DEPARTMENT'):
	print(row)
conn.close()

(5, 'Software Group', 30002, 'L0002    ')
(7, 'Design Team', 30003, 'L0003    ')

## adding 3rd table

In [19]:
conn = sqlite3.connect(r'dataset.db')

loc_data = pd.read_csv('dataset/locatiodata.csv')
loc_data.to_sql('LOCATION', conn, if_exists='replace', index=False)

cur = conn.cursor()
for row in cur.execute('SELECT * FROM LOCATION'):
	print(row)
conn.close()

('L0002    ', 5)
('L0003    ', 7)

## adding 4th table

In [21]:
conn = sqlite3.connect(r'dataset.db')

job_data = pd.read_csv('dataset/jobsdata.csv')
job_data.to_sql('JOBS', conn, if_exists='replace', index=False)

cur = conn.cursor()
for row in cur.execute('SELECT * FROM JOBS'):
	print(row)
conn.close()

(200, 'Sr.Software Dev', 60000.0, 80000.0)
(220, 'Sr. Designer', 70000.0, 90000.0)
(234, 'Sr. Designer', 70000.0, 90000.0)
(300, 'Jr.Software Dev', 40000.0, 60000.0)
(400, 'Jr.Software Dev', 40000.0, 60000.0)
(500, 'Jr. Architect', 50000.0, 70000.0)
(600, 'Lead Architect', 70000.0, 100000.0)
(650, 'Jr. Designer', 60000.0, 70000.0)
(660, 'Jr. Designer', 60000.0, 70000.0)

## adding 5th table

In [23]:
conn = sqlite3.connect(r'dataset.db')

jobh_data = pd.read_csv('dataset/jobhistory.csv')
jobh_data.to_sql('JOBHISTORY', conn, if_exists='replace', index=False)

cur = conn.cursor()
for row in cur.execute('SELECT * FROM JOBHISTORY'):
	print(row)
conn.close()

('E1002    ', '2001-08-01', 200, 5)
('E1003    ', '2001-08-16', 300, 5)
('E1004    ', '2000-08-16', 400, 5)
('E1005    ', '2000-05-30', 500, 2)
('E1006    ', '2001-08-16', 600, 2)
('E1007    ', '2002-05-30', 650, 7)
('E1008    ', '2010-05-06', 660, 7)
('E1009    ', '2016-08-16', 234, 7)
('E1010    ', '2016-08-16', 220, 5)

# Printing schema

In [25]:
con = sqlite3.connect('dataset.db') 
pd.read_sql_query("SELECT * FROM sqlite_master where type = 'table';", con)

    type  ...                                                sql
0  table  ...  CREATE TABLE "EMPLOYEE" (\n"EMP_ID" TEXT,\n  "...
1  table  ...  CREATE TABLE "DEPARTMENT" (\n"DEPT_ID_DEP" INT...
2  table  ...  CREATE TABLE "LOCATION" (\n"LOCT_ID" TEXT,\n  ...
3  table  ...  CREATE TABLE "JOBS" (\n"JOB_IDENT" INTEGER,\n ...
4  table  ...  CREATE TABLE "JOBHISTORY" (\n"EMPL_ID" TEXT,\n...

[5 rows x 5 columns]

In [28]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",con)
tables = tables["Table_Name"].values.tolist()

In [29]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,con)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of EMPLOYEE

    cid        name     type  notnull dflt_value  pk
0     0      EMP_ID     TEXT        0       None   0
1     1      F_NAME     TEXT        0       None   0
2     2      L_NAME     TEXT        0       None   0
3     3         SSN  INTEGER        0       None   0
4     4      B_DATE     TEXT        0       None   0
5     5         SEX     TEXT        0       None   0
6     6     ADDRESS     TEXT        0       None   0
7     7      JOB_ID  INTEGER        0       None   0
8     8      SALARY     REAL        0       None   0
9     9  MANAGER_ID  INTEGER        0       None   0
10   10      DEP_ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of DEPARTMENT

   cid         name     type  notnull dflt_value  pk
0    0  DEPT_ID_DEP  INTEGER        0       None   0
1    1     DEP_NAME     TEXT        0       None   0
2    2   MANAGER_ID  INTEGER        0       None   0
3    3       LOC_ID     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of LOCATION

   cid        name     type  notnull dflt_value  pk
0    0     LOCT_ID     TEXT        0       None   0
1    1  DEP_ID_LOC  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of JOBS

   cid        name     type  notnull dflt_value  pk
0    0   JOB_IDENT  INTEGER        0       None   0
1    1   JOB_TITLE     TEXT        0       None   0
2    2  MIN_SALARY     REAL        0       None   0
3    3  MAX_SALARY     REAL        0       None   0

----------------------------------------------------------------------------------------------------


Schema of JOBHISTORY

   cid        name     type  notnull dflt_value  pk
0    0     EMPL_ID     TEXT        0       None   0
1    1  START_DATE     TEXT        0       None   0
2    2     JOBS_ID  INTEGER        0       None   0
3    3     DEPT_ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Writing SQL query

In [26]:
pd.read_sql_query("select * from EMPLOYEE where JOB_ID IN (select JOB_IDENT from JOBS);", con)

      EMP_ID   F_NAME   L_NAME     SSN  ... JOB_ID   SALARY MANAGER_ID  DEP_ID
0  E1002        Alice    James  123457  ...    200  80000.0      30002       5
1  E1003        Steve    Wells  123458  ...    300  50000.0      30002       5
2  E1004      Santosh    Kumar  123459  ...    400  60000.0      30004       5
3  E1005        Ahmed  Hussain  123410  ...    500  70000.0      30001       2
4  E1006        Nancy    Allen  123411  ...    600  90000.0      30001       2
5  E1007         Mary   Thomas  123412  ...    650  65000.0      30003       7
6  E1008      Bharath    Gupta  123413  ...    660  65000.0      30003       7
7  E1009       Andrea    Jones  123414  ...    234  70000.0      30003       7
8  E1010          Ann    Jacob  123415  ...    220  70000.0      30004       5

[9 rows x 11 columns]



---